<a href="https://colab.research.google.com/github/crzysab/Python-Pandas/blob/main/Pandas_16.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Menata ulang Data Frame dengan multiple indexes menggunakan unstack**

___

Import Modules

In [ ]:
import pandas as pd
from google.colab import drive

Persiapan Data Frame

In [ ]:
drive.mount('/content/drive')
df = pd.read_csv("/content/drive/My Drive/dataset/titanicfull.csv")

Mounted at /content/drive

In [ ]:
df.head()

   pclass  survived  ...    cabin embarked
0       1         1  ...       B5        S
1       1         1  ...  C22 C26        S
2       1         0  ...  C22 C26        S
3       1         0  ...  C22 C26        S
4       1         0  ...  C22 C26        S

[5 rows x 11 columns]

Data Frame dengan Multiple Indexes dari Hasil Groupping

In [ ]:
df.groupby(['sex', 'pclass'])['survived'].mean().to_frame()

               survived
sex    pclass
female 1       0.965278
       2       0.886792
       3       0.490741
male   1       0.340782
       2       0.146199
       3       0.152130

Menata ulang Data Frame dengan multiple indexes

In [ ]:
df.groupby(['sex', 'pclass'])['survived'].mean().unstack()

pclass         1         2         3
sex
female  0.965278  0.886792  0.490741
male    0.340782  0.146199  0.152130